app/Controllers/Admin/Users.php

	public function create()
	{
        $user = new User($this->request->getPost());
		// $user = service('auth')->getCurrentUser();
        //Since this is the admin controller we can safely deactivate
        //the protected fields feature when we insert a new record
		if ($this->model->protect(false)->insert($user)) {
---
INSERT INTO `user` (`name`, `email`, `is_active`, `is_admin`, `created_at`, `updated_at`, `password_hash`) VALUES ('And another admin', 'admin4@example.com', '1', '0', '2022-02-05 18:10:05', '2022-02-05 18:10:05', '$2y$10$WEvxPYx89KLT.cF6fkBpVOiXuJcajsDXmu3Qa4aj5Otel3ICaazIu')