app/Controllers/Password.php

    public function processForgot()
    {
        $model = new \App\Models\UserModel;

        $user = $model->findByEmail($this->request->getPost('email'));

        if ($user && $user->is_active) {

            $user->startPasswordReset();
            $model->save($user);
---
UPDATE `user` SET `reset_hash` = '847476ebb2f5ae69f3eb885488db6ff7dc57155cb68f096228dbe4071428f403', `reset_expires_at` = '2022-02-10 09:20:49', `updated_at` = '2022-02-10 07:20:49'
WHERE `user`.`id` IN ('15')