app/Models/UserModel.php

    public function findByEmail($email)
    {
        return $this->where('email', $email)
                      ->first();
---
SELECT *
FROM `user`
WHERE `email` = 'Frank@gmail.com'
 LIMIT 1

    public function getUserForPasswordReset($token)
    {
        //As with account activation we are storing the token
        //hash in the database
        //so in order to query the the database
        //That matches the token argument we
        //need to calculate its hash
        $token = new Token($token);

        $token_hash = $token->getHash();

        $user = $this->where('reset_hash', $token_hash)
             ->first();
---
SELECT *
FROM `user`
WHERE `reset_hash` = '8042da7c734b62d319e2e99e664e11caf18f37f3528d03e82851f7790fddd979'
 LIMIT 1